import { Button } from "../../components/Button"

const Banner = () => {
    return (
        <section id="new" className="banner">
            <div className="bannerContainer">
                <div className="bannerName">
                    <svg width="50" height="49" viewBox="0 0 50 49" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M26.8193 13.3984L27.458 15.7598L29.2725 14.1191L35.1572 8.79688L32.7617 16.3613L32.0234 18.6934L34.4365 18.2939L42.2656 16.998L36.1602 22.0674L34.2773 23.6299L36.5234 24.5986L43.8096 27.7412L35.9336 28.7041L33.5049 29.001L34.8711 31.0303L39.3008 37.6123L32.1553 34.165L29.9521 33.1016L30.0039 35.5479L30.1709 43.4805L26.0234 36.7158L24.7451 34.6299L23.4668 36.7158L19.3184 43.4805L19.4863 35.5479L19.5381 33.1016L17.335 34.165L10.1885 37.6123L14.6191 31.0303L15.9854 29.001L13.5566 28.7041L5.67969 27.7412L12.9668 24.5986L15.2129 23.6299L13.3301 22.0674L7.22363 16.998L15.0537 18.2939L17.4668 18.6934L16.7285 16.3613L14.332 8.79688L20.2178 14.1191L22.0322 15.7598L22.6709 13.3984L24.7451 5.73926L26.8193 13.3984Z" stroke="#EEDB6D" strokeWidth="3"/>
                    </svg>

                    <h1>Новая коллекция французских авторов</h1>
                </div>
                <div className="bannerParagraph">
                    <p>Сложно сказать, почему акционеры крупнейших компаний призывают нас к новым свершениям, которые, в свою очередь, должны быть заблокированы в рамках своих собственных рациональных ограничений. </p>
                    <p>Принимая во внимание показатели успешности, граница обучения кадров предопределяет высокую востребованность направлений прогрессивного развития.</p>
                </div>
            
                <Button class='yellowBtn' text='Ознакомиться'></Button>
            </div>
        </section>
    )
}

export default Banner